insert into settlements (code, name_ru, name_kz, district, lat, lon)
values
  ('AKTAU', 'Актау', 'Ақтау', 'Актау', 43.6353364, 51.1682220),
  ('AKSHUKUR', 'Акшукур', 'Ақшұқыр', 'Тупкараганский район', 43.7831766, 51.0605022),
  ('SHETPE', 'Шетпе', 'Шетпе', 'Мангистауский район', 44.1413139, 52.1556413),
  ('BEINEU', 'Бейнеу', 'Бейнеу', 'Бейнеуский район', 45.3213770, 55.1862260),
  ('ZHANAOZEN', 'Жанаозен', 'Жаңаөзен', 'Жанаозен', 43.3381034, 52.8556219),
  ('KURYK', 'Курык', 'Құрық', 'Каракиянский район', 43.1766640, 51.6796799),
  ('ZHETYBAI', 'Жетыбай', 'Жетібай', 'Каракиянский район', 43.5883652, 52.1014626),
  ('MUNAYSHY', 'Мунайшы', 'Мұнайшы', 'Каракиянский район', 43.4985033, 52.0879358),
  ('SENEK', 'Сенек', 'Сенек', 'Каракиянский район', 43.3647540, 53.3882260),
  ('USHTAGAN', 'Уштаган', 'Үштаған', 'Мангистауский район', 43.8253470, 52.7226095),
  ('FORT_SHEVCHENKO', 'Форт-Шевченко', 'Форт-Шевченко', 'Тупкараганский район', 44.5085560, 50.2619290)
on conflict (code) do update set
  name_ru = excluded.name_ru,
  name_kz = excluded.name_kz,
  district = excluded.district,
  lat = excluded.lat,
  lon = excluded.lon;
